# Створіть словник для категорій та підкатегорій
hierarchy = {
    'Букви': {
        'Голосні': ['A', 'E', 'I', 'O', 'U'],
        'Приголосні': {
            'Лабіальні': ['B', 'P'],
            'Дентальні': ['D', 'T'],
            'Альвеолярні': ['C', 'S']
        }
    }
}

# Функція для вибору категорії та підкатегорії
def вибрати_категорію(ієрархія):
    категорії = list(ієрархія.keys())
    for i, категорія in enumerate(категорії):
        print(f"{i + 1}. {категорія}")

    вибір = int(input("Виберіть категорію за номером: ")) - 1
    обрана_категорія = категорії[вибір]
    підкатегорія = ієрархія[обрана_категорія]

    if isinstance(підкатегорія, dict):
        вибрана_підкатегорія = вибрати_категорію(підкатегорія)
        return обрана_категорія, вибрана_підкатегорія
    
    elif isinstance(підкатегорія, list):
        for i, elem in enumerate(підкатегорія):
            print(f"{i + 1}. {elem}")
        
    else:
        return обрана_категорія, підкатегорія

обрана_категорія, обрана_підкатегорія = вибрати_категорію(hierarchy)
print(f"Ви обрали категорію: {обрана_категорія}")
if isinstance(обрана_підкатегорія, list):
    print(f"Можливі варіанти: {', '.join(обрана_підкатегорія)}")
